PASSWORD_REGEXP = r'\A(?=[A-Za-z0-9$%@#&*^!?]{8,}\Z)(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?!.*(.)\1)(?=.*([$%@#&*!?^]).*(?!\2)[$%@#&*!?^]).*'
COLOR_REGEXP = (
    r'\A(?:rgb\(\s*(?:(?:[0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\s*,\s*){2}(?:[0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\s*\)'
    r'|rgb\(\s*(?:(?:0|[1-9][0-9]?|100)%\s*,\s*){2}(?:0|[1-9][0-9]?|100)%\s*\)'
    r'|#(?:[0-9A-Fa-f]{3}){1,2}'
    r'|hsl\(\s*(?:(?:[0-9]|[1-9][0-9]|[12][0-9]{2}|3[0-5][0-9]|360)\s*,\s*)(?:0|[1-9][0-9]?|100)%\s*,\s*(?:0|[1-9][0-9]?|100)%\s*\))\Z'
)
EXPRESSION_REGEXP = (
    r'(?P<function>(?:sin|cos|tg|ctg|tan|cot|sinh|cosh|th|cth|tanh|coth|ln|lg|log|exp|sqrt|cbrt|abs|sign)(?![a-zA-Z0-9_]))'
    r'|(?P<constant>(?:pi|e|sqrt2|ln2|ln10)(?![a-zA-Z0-9_]))'
    r'|(?P<variable>(?:[a-zA-Z_][a-zA-Z0-9_]*))'
    r'|(?P<number>(?:[0-9]+(?:\.[0-9]+)?))'
    r'|(?P<operator>(?:\^|\*|/|-|\+))'
    r'|(?P<left_parenthesis>\()|(?P<right_parenthesis>\))'
)
DATES_REGEXP = (
    r'\A(?:'
    # день{-./}месяц{-./}год
    r'(?=(?:0?[1-9]|[12][0-9]|3[01])([./-]))'
    r'(?:'
        # месяцы с 31 днем
        r'(?:0?[1-9]|[12][0-9]|3[01])\1(?:0?[13578]|1[02])\1[0-9]+'
        # месяцы с 30 днями
        r'|(?:0?[1-9]|[12][0-9]|30)\1(?:0?[469]|11)\1[0-9]+'
        # февраль
        r'|(?:0?[1-9]|1[0-9]|2[0-8])\1(?:0?2)\1[0-9]+'
        # 29 февраля (високосный год)
        r'|29\1(?:0?2)\1(?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00))'

    # год{-./}месяц{-./}день
    r'|(?=[0-9]+([./-]))'
    r'(?:'
        # месяцы с 31 днем
        r'[0-9]+\2(?:0?[13578]|1[02])\2(?:0?[1-9]|[12][0-9]|3[01])'
        # месяцы с 30 днями
        r'|[0-9]+\2(?:0?[469]|11)\2(?:0?[1-9]|[12][0-9]|30)'
        # февраль
        r'|[0-9]+\2(?:0?2)\2(?:0?[1-9]|1[0-9]|2[0-8])'
        # 29 февраля (високосный год)
        r'|(?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00)\2(?:0?2)\2(?:29))'

    # день месяц_русскими год
    r'|(?:'
        # месяцы с 31 днем
        r'(?:0?[1-9]|[12][0-9]|3[01]) (?:января|марта|мая|июля|августа|октября|декабря) [0-9]+'
        # месяцы с 30 днями
        r'|(?:0?[1-9]|[12][0-9]|30) (?:апреля|июня|сентября|ноября) [0-9]+'
        # февраль
        r'|(?:0?[1-9]|1[0-9]|2[0-8]) февраля [0-9]+'
        # 29 февраля (високосный год)
        r'|29 февраля (?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00))'

    # месяц_английскими день, год (сокращенная и полная форма записи)
    r'|(?:'
        # месяцы с 31 днем
        r'(?:Jan(?:uary)?|Mar(?:ch)?|May|Jul(?:y)?|Aug(?:ust)?|Oct(?:ober)?|Dec(?:ember)?) (?:0?[1-9]|[12][0-9]|3[01]), [0-9]+'
        # месяцы с 30 днями
        r'|(?:Apr(?:il)?|Jun(?:e)?|Sep(?:tember)?|Nov(?:ember)?) (?:0?[1-9]|[12][0-9]|30), [0-9]+'
        # февраль
        r'|Feb(?:ruary)? (?:0?[1-9]|1[0-9]|2[0-8]), [0-9]+'
        # 29 февраля (високосный год)
        r'|Feb(?:ruary)? 29, (?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00))'

    # год, месяц_английскими день (сокращенная и полная форма записи)
    r'|(?:'
        # месяцы с 31 днем
        r'[0-9]+, (?:Jan(?:uary)?|Mar(?:ch)?|May|Jul(?:y)?|Aug(?:ust)?|Oct(?:ober)?|Dec(?:ember)?) (?:0?[1-9]|[12][0-9]|3[01])'
        # месяцы с 30 днями
        r'|[0-9]+, (?:Apr(?:il)?|Jun(?:e)?|Sep(?:tember)?|Nov(?:ember)?) (?:0?[1-9]|[12][0-9]|30)'
        # февраль
        r'|[0-9]+, Feb(?:ruary)? (?:0?[1-9]|1[0-9]|2[0-8])'
        # 29 февраля (високосный год)
        r'|(?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00), Feb(?:ruary)? 29))\Z'
)

from bracket import build_reg_final
PARENTHESIS_REGEXP = build_reg_final(10)
SENTENCES_REGEXP = r'' #(?P<sentence>\S.*?(?:[.?!]+(?=\s|$)|(?=\r?\n|$)))
PERSONS_REGEXP = r''
SERIES_REGEXP = r''
