PASSWORD_REGEXP = r'\A(?=[A-Za-z0-9$%@#&*^!?]{8,}\Z)(?=.*[A-Z])(?=.*[a-z])(?=.*[0-9])(?!.*(.)\1)(?=.*([$%@#&*!?^]).*(?!\2)[$%@#&*!?^]).*'
COLOR_REGEXP = (
    r'\A(?:rgb\(\s*(?:(?:[0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\s*,\s*){2}(?:[0-9]|[1-9][0-9]|1[0-9]{2}|2[0-4][0-9]|25[0-5])\s*\)'
    r'|rgb\(\s*(?:(?:0|[1-9][0-9]?|100)%\s*,\s*){2}(?:0|[1-9][0-9]?|100)%\s*\)'
    r'|#(?:[0-9A-Fa-f]{3}){1,2}'
    r'|hsl\(\s*(?:(?:[0-9]|[1-9][0-9]|[12][0-9]{2}|3[0-5][0-9]|360)\s*,\s*)(?:0|[1-9][0-9]?|100)%\s*,\s*(?:0|[1-9][0-9]?|100)%\s*\))\Z'
)
EXPRESSION_REGEXP = (
    r'(?P<function>(?:sin|cos|tg|ctg|tan|cot|sinh|cosh|th|cth|tanh|coth|ln|lg|log|exp|sqrt|cbrt|abs|sign)(?![a-zA-Z0-9_]))'
    r'|(?P<constant>(?:pi|e|sqrt2|ln2|ln10)(?![a-zA-Z0-9_]))'
    r'|(?P<variable>(?:[a-zA-Z_][a-zA-Z0-9_]*))'
    r'|(?P<number>(?:[0-9]+(?:\.[0-9]+)?))'
    r'|(?P<operator>(?:\^|\*|/|-|\+))'
    r'|(?P<left_parenthesis>\()|(?P<right_parenthesis>\))'
)
DATES_REGEXP = (
    r'\A(?:'
    # день{-./}месяц{-./}год
    r'(?=(?:0?[1-9]|[12][0-9]|3[01])([./-]))'
    r'(?:'
        # месяцы с 31 днем
        r'(?:0?[1-9]|[12][0-9]|3[01])\1(?:0?[13578]|1[02])\1[0-9]+'
        # месяцы с 30 днями
        r'|(?:0?[1-9]|[12][0-9]|30)\1(?:0?[469]|11)\1[0-9]+'
        # февраль
        r'|(?:0?[1-9]|1[0-9]|2[0-8])\1(?:0?2)\1[0-9]+'
        # 29 февраля (високосный год)
        r'|29\1(?:0?2)\1(?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00))'

    # год{-./}месяц{-./}день
    r'|(?=[0-9]+([./-]))'
    r'(?:'
        # месяцы с 31 днем
        r'[0-9]+\2(?:0?[13578]|1[02])\2(?:0?[1-9]|[12][0-9]|3[01])'
        # месяцы с 30 днями
        r'|[0-9]+\2(?:0?[469]|11)\2(?:0?[1-9]|[12][0-9]|30)'
        # февраль
        r'|[0-9]+\2(?:0?2)\2(?:0?[1-9]|1[0-9]|2[0-8])'
        # 29 февраля (високосный год)
        r'|(?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00)\2(?:0?2)\2(?:29))'

    # день месяц_русскими год
    r'|(?:'
        # месяцы с 31 днем
        r'(?:0?[1-9]|[12][0-9]|3[01]) (?:января|марта|мая|июля|августа|октября|декабря) [0-9]+'
        # месяцы с 30 днями
        r'|(?:0?[1-9]|[12][0-9]|30) (?:апреля|июня|сентября|ноября) [0-9]+'
        # февраль
        r'|(?:0?[1-9]|1[0-9]|2[0-8]) февраля [0-9]+'
        # 29 февраля (високосный год)
        r'|29 февраля (?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00))'

    # месяц_английскими день, год (сокращенная и полная форма записи)
    r'|(?:'
        # месяцы с 31 днем
        r'(?:Jan(?:uary)?|Mar(?:ch)?|May|Jul(?:y)?|Aug(?:ust)?|Oct(?:ober)?|Dec(?:ember)?) (?:0?[1-9]|[12][0-9]|3[01]), [0-9]+'
        # месяцы с 30 днями
        r'|(?:Apr(?:il)?|Jun(?:e)?|Sep(?:tember)?|Nov(?:ember)?) (?:0?[1-9]|[12][0-9]|30), [0-9]+'
        # февраль
        r'|Feb(?:ruary)? (?:0?[1-9]|1[0-9]|2[0-8]), [0-9]+'
        # 29 февраля (високосный год)
        r'|Feb(?:ruary)? 29, (?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00))'

    # год, месяц_английскими день (сокращенная и полная форма записи)
    r'|(?:'
        # месяцы с 31 днем
        r'[0-9]+, (?:Jan(?:uary)?|Mar(?:ch)?|May|Jul(?:y)?|Aug(?:ust)?|Oct(?:ober)?|Dec(?:ember)?) (?:0?[1-9]|[12][0-9]|3[01])'
        # месяцы с 30 днями
        r'|[0-9]+, (?:Apr(?:il)?|Jun(?:e)?|Sep(?:tember)?|Nov(?:ember)?) (?:0?[1-9]|[12][0-9]|30)'
        # февраль
        r'|[0-9]+, Feb(?:ruary)? (?:0?[1-9]|1[0-9]|2[0-8])'
        # 29 февраля (високосный год)
        r'|(?:0+|0*[48]|[0-9]*(?:0[48]|[2468][048]|[13579][26])|0*[48]00|[0-9]*(?:0[048]|[2468][048]|[13579][26])00), Feb(?:ruary)? 29))\Z'
)

from bracket import build_reg_final
PARENTHESIS_REGEXP = build_reg_final(10)

SENTENCES_REGEXP = (
    r'(?P<sentence>'
        # список через ;
        r'\S[^\r\n]*:[ \t]*\r?\n' # предложение перед списком
        r'(?:[ \t]*[0-9]+\.[^\r\n]*;[ \t]*\r?\n)+' # все пункты, кроме последнего
        r'[ \t]*[0-9]+\.[^\r\n]*?(?:\.{3}|…|[!?]+|\.)' # последний пункт
        r'[\"»”’]*[ \t]*(?=\r?\n|$)' # кавычки после последнего пункта
        
        # обычное предложение
        r'|(?:[0-9]+(?:\.|\))[ \t]+)?\S.*?' # может начинаться с номера пункта
        r'(?:(?<!\b[А-ЯЁа-яёA-Za-z])(?:\.{3}|…)[\"»”’]*' # многоточие
        r'(?=\s*(?:(?:[«\"“(]\s*)?[А-ЯЁA-Z0-9]|$))|[!?]+[\"»”’]*(?=\s*(?:(?:[«\"“(]\s*)?[А-ЯЁA-Z0-9]|$))|' # ? и ! знаки
        r'(?<!\b[А-ЯЁа-яёA-Za-z])(?<!\bдр)(?<!\bстр)(?<!\bрис)(?<!\bул)(?<!\bим)(?<!\bсм)(?<!\.)\.(?!\.)' # точка с проверками на сокращение слов
        r'[\"»”’]*(?=\s*(?:(?:[«\"“(]\s*)?[А-ЯЁA-Z0-9]|$))' # закрывающая кавычка после знака + необязательный пробел
        r'|(?=\r?\n|$)))' # предложение без знака препинания
)
PERSONS_REGEXP = (
    r'(?<![А-ЯЁа-яё-])'
    # титул (в сущность не входит)
    r'(?:([Гг]раф(?:а|у|ом|е)?|[Кк]няз(?:ь|я|ю|ем|е)|[Дд]октор(?:а|у|ом|е)?|[Тт]оварищ(?:а|у|ем|е)?|[Гг]ражданин(?:а|у|ом|е)?|[Гг]осподин(?:а|у|ом|е)?|[Гг]оспож(?:а|и|е|у|ой)|[Пп]рофессор(?:а|у|ом|е)?|[Пп]резидент(?:а|у|ом|е)?|[Рр]ежисс[её]р(?:а|у|ом|е)?|[Аа]кт[её]р(?:а|у|ом|е)?|[Аа]ктрис(?:а|ы|е|у|ой))[ \t]+)?'

    r'(?P<person>'
        # имя + частица + фамилия
        # отдельные частицы
        r'(?:(?:[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*[ \t]+){1,3}(?:ван|фон|де|да|дер|ден|ла|ле|ибн|бин|бен)(?:[ \t]+(?:ван|фон|де|да|дер|ден|ла|ле|ибн|бин|бен)){0,1}[ \t]+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*'
            # частица стоит первой
            r'|(?:[Ии]бн|[Бб]ин|[Бб]ен|[Вв]ан|[Фф]он|[Дд]е|[Дд]а)[ \t]+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*'
            # д’ / д'
            r'|(?:[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*[ \t]+){1,3}[дД][’\'][А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*'
            # тюркская форма
            r'|[А-ЯЁ][а-яё]+[ \t]+[А-ЯЁ][а-яё]+[ \t]+(?:оглы|оглу|кызы|уулу)[ \t]+[А-ЯЁ][а-яё]+'

        # имя + римское число / число словами
        r'|[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*[ \t]+(?:[IVXLCDM]+|Перв(?:ый|ого|ому|ым|ом|ая|ой|ую)|Втор(?:ой|ого|ому|ым|ом|ая|ую)|Трет(?:ий|ьего|ьему|ьим|ьем|ья|ьей|ью)|Четвёрт(?:ый|ого|ому|ым|ом|ая|ой|ую)|Пят(?:ый|ого|ому|ым|ом|ая|ой|ую)|Шест(?:ой|ого|ому|ым|ом|ая|ую)|Седьм(?:ой|ого|ому|ым|ом|ая|ую)|Восьм(?:ой|ого|ому|ым|ом|ая|ую)|Девят(?:ый|ого|ому|ым|ом|ая|ой|ую)|Десят(?:ый|ого|ому|ым|ом|ая|ой|ую))'

        # инициалы + фамилия или фамилия + инициалы
        r'|(?:[А-ЯЁ]\.[ \t]*){1,2}[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*|[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*[ \t]+[А-ЯЁ]\.(?:[ \t]*[А-ЯЁ]\.)?'

        # имя отчество фамилия 
        r'|(?:[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*[ \t]+[А-ЯЁ][а-яё]*(?:(?:ьевич|евич|ович|ыч|ич)(?:а|у|ем|е)?|(?:ьевн|евн|овн|иничн|ичн)(?:а|ы|е|у|ой|ою))[ \t]+[А-ЯЁ][а-яё]*(?:(?:ов|ев|ёв|ин|ын)(?:а|у|ым|е|ой|ою|ы|ых|ыми)?|(?:ск|цк)(?:ий|ого|ому|им|ом|ая|ой|ую|ие|их|ими)|(?:ый|ой|ого|ому|ым|ом|ая|ую|ые|ых|ыми|ий|его|ему|им|ем|яя|ей|юю|ие|их|ими)|(?:енко|ко|дзе|швили|заде|ене|йте)|(?:чук|ук|юк|ак|як|ич|ян|янц|ман|берг|бург|фельд|штейн|айтис|явичюс|ас|ис|ус|с|инг|тер|сон)(?:а|у|ом|е)?|ец)'
        # фио
        r'|[А-ЯЁ][а-яё]*(?:(?:ов|ев|ёв|ин|ын)(?:а|у|ым|е|ой|ою|ы|ых|ыми)?|(?:енко|ченко|дзе|швили|заде|янц|айтис|явичюс)|(?:ман|берг|штейн)(?:а|у|ом|е)?)[ \t]+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*[ \t]+[А-ЯЁ][а-яё]*(?:(?:ьевич|евич|ович|ыч|ич)(?:а|у|ем|е)?|(?:ьевн|евн|овн|иничн|ичн)(?:а|ы|е|у|ой|ою)))'

        # имя + фамилия или отчество
        r'|(?:[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*[ \t]+(?:[А-ЯЁ][а-яё]*(?:(?:ов|ев|ёв|ин|ын)(?:а|у|ым|е|ой|ою|ы|ых|ыми)?|(?:ск|цк)(?:ий|ого|ому|им|ом|ая|ой|ую|ие|их|ими)|(?:ый|ой|ого|ому|ым|ом|ая|ую|ые|ых|ыми|ий|его|ему|им|ем|яя|ей|юю|ие|их|ими)|(?:енко|ко|дзе|швили|заде|ене|йте)|(?:чук|ук|юк|ак|як|ич|ян|янц|ман|берг|бург|фельд|штейн|айтис|явичюс|ас|ис|ус|с|инг|тер|сон)(?:а|у|ом|е)?|ец)|[А-ЯЁ][а-яё]*(?:(?:ьевич|евич|ович|ыч|ич)(?:а|у|ем|е)?|(?:ьевн|евн|овн|иничн|ичн)(?:а|ы|е|у|ой|ою)))'
        # фамилия имя
        r'|[А-ЯЁ][а-яё]*(?:(?:ов|ев|ёв|ин|ын)(?:а|у|ым|е|ой|ою|ы|ых|ыми)?|(?:енко|ченко|дзе|швили|заде|янц|айтис|явичюс)|(?:ман|берг|штейн)(?:а|у|ом|е)?)[ \t]+[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*)'

        # одиночное имя / фамилия с дефисом
        r'|[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)+'
        # одиночная фамилия
        r'|[А-ЯЁ][а-яё]*(?:(?:ов|ев|ёв)(?:а|у|ым|е|ой|ою|ы|ых|ыми)?|(?:енко|ченко|дзе|швили|заде|янц|айтис|явичюс))'
        # одиночное отчество
        r'|[А-ЯЁ][а-яё]*(?:(?:ьевич|евич|ович|ыч|ич)(?:а|у|ем|е)?|(?:ьевн|евн|овн|иничн|ичн)(?:а|ы|е|у|ой|ою))'

        # имя после титула
        r'|(?(1)[А-ЯЁ][а-яё]+(?:-[А-ЯЁ][а-яё]+)*|(?!))))'

    r'(?![А-ЯЁа-яё-])'
)
SERIES_REGEXP = (
    # название сериала
    r'<h1\b[^>]*\bclass=["\']level2["\'][^>]*>\s*<a\b[^>]*\bhref=["\']/series/\d+/["\'][^>]*>(?P<name>[^<]+)</a>'
    # общее количество эпизодов
    r'|<b>Эпизоды:</b>\s*</td>\s*<td\b[^>]*>\s*<table\b[^>]*>\s*<tr>\s*<td\b[^>]*\bclass=["\']news["\'][^>]*>(?P<episodes_count>\d+)</td>'
    # информация о сезоне
    r'|>Сезон\s+(?P<season>\d+)</h1>\s*(?:(?P<season_year>\d{4}),\s*)?эпизодов:\s*(?P<season_episodes>\d+)'
    # информация об эпизоде
    r'|>Эпизод\s+(?P<episode_number>\d+)</span>\s*<br\s*/?>\s*<h1\b[^>]*\bclass=["\']moviename-big["\'][^>]*>\s*<b>(?P<episode_name>[^<]*)</b>\s*</h1>\s*'
    # оригинальное название
    r'(?:<span\b[^>]*\bclass=["\']episodesOriginalName["\'][^>]*>(?P<episode_original_name>[^<]*)</span>\s*)?'
    # дата выхода
    r'</td>\s*<td\b[^>]*>\s*(?:(?P<episode_date>\d{1,2}\s+[А-Яа-яЁё]+\s+\d{4}))?\s*</td>'
)
